H-000-H/Project-repository/hal/hal_i2c_ch32v30x.c
/**
 *@copyright SPDX-License-Identifier: Apache-2.0
 *@file hal_i2c_ch32v30x.c
 *@brief CH32V307 I2C HAL 强符号实现 (覆盖 mini_tree/hal/i2c/hal_i2c.c 的 weak 空桩)
 *@author H-000-H
 *@details
 *   分层约束: 平台层 (hal), 只依赖 WCH 标准外设库与 mini_tree hal 头。
 *   直投约定 (对齐 hal_i2c.h):
 *   - i2c = I2Cx_BASE, i2c_clk_periph = RCC_APB1Periph_I2Cx;
 *   - SCL/SDA 缺省复用开漏输出 50MHz (WCH F1 型 I2C 引脚);
 *   - device cfg: clock_speed_hz / duty_cycle / own_address 直投 WCH 宏,
 *     address 为 7-bit 右对齐 (传输时内部左移);
 *   - 主机同步收发走 CPU polling 状态机 (超时按 SystemCoreClock 折算);
 *   - DMA 路径: DMA1 固定映射 (I2C1 TX/RX = CH6/CH7, I2C2 TX/RX = CH2/CH3),
 *     传输耗时随长度增长, 超时预算按字节数/速率扩容;
 *     10-bit 地址未实现。
 */

#include "ch32v30x_hal_common.h"
#include "hal_i2c.h"

/**
 * @brief 等待指定标志到达目标电平 (消耗超时预算)
 * @param[in] i2c I2C 外设寄存器指针 (出参, 仅读标志)
 * @param[in] flag I2C_FLAG_* 标志位 (直投)
 * @param[in] want 目标电平 (SET/RESET)
 * @param[in,out] budget 空转预算指针 (消耗至 0 返回超时)
 * @return 成功返回 MINI_OK, 超时返回 MINI_ERR_TIMEOUT
 */
static int s_wait_flag(I2C_TypeDef* i2c, uint32_t flag, FlagStatus want, uint32_t* budget)
{
    while (I2C_GetFlagStatus(i2c, flag) != want)
    {
        if (*budget == 0U)
            return MINI_ERR_TIMEOUT;
        (*budget)--;
    }
    return MINI_OK;
}

/**
 * @brief 应用 client 配置到 I2C 外设 (首次打开或速率变更时)
 * @param[in] host I2C 主机上下文 (出参, 写入 active_cfg/状态)
 * @param[in] cfg 目标设备配置 (速率/地址与 active_cfg 一致且已就绪则跳过)
 * @return 成功返回 MINI_OK, 10-bit 地址返回 MINI_ERR_NOTSUPP
 */
static int s_i2c_apply_dev_cfg(struct hal_i2c_bus_host* host,
                               const struct hal_i2c_device_config* cfg)
{
    if ((host->bus_ready) && (host->active_cfg.clock_speed_hz == cfg->clock_speed_hz) &&
        (host->active_cfg.address == cfg->address))
    {
        return MINI_OK;
    }
    if (cfg->addr_width != 0U)
        return MINI_ERR_NOTSUPP;

    I2C_TypeDef* i2c = (I2C_TypeDef*)host->i2c;
    I2C_Cmd(i2c, DISABLE);

    I2C_InitTypeDef ii;
    ii.I2C_ClockSpeed = (cfg->clock_speed_hz != 0U) ? cfg->clock_speed_hz : 100000U;
    ii.I2C_Mode = (host->cfg.mode != 0U) ? (uint16_t)host->cfg.mode : I2C_Mode_I2C;
    ii.I2C_DutyCycle = (cfg->duty_cycle != 0U) ? (uint16_t)cfg->duty_cycle : I2C_DutyCycle_2;
    ii.I2C_OwnAddress1 = (uint16_t)cfg->own_address;
    ii.I2C_Ack = I2C_Ack_Enable;
    ii.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
    I2C_Init(i2c, &ii);
    I2C_Cmd(i2c, ENABLE);

    host->active_cfg = *cfg;
    host->bus_ready = true;
    return MINI_OK;
}

/**
 * @brief 主机写段 (START + addr + data... + 可选 STOP, NACK 检测返回 IO 错误)
 * @param[in] i2c I2C 外设寄存器指针 (出参, 仅写寄存器)
 * @param[in] addr_byte 7-bit 地址左移后的地址字节 (含读写位)
 * @param[in] tx 发送缓冲区首地址 (出参, 仅读)
 * @param[in] len 发送字节数 (出参)
 * @param[in] send_stop 是否发送 STOP (先写后读时写段发 START 不发 STOP)
 * @param[in,out] budget 空转预算指针 (消耗至 0 返回超时)
 * @return 成功返回 MINI_OK, 从机 NACK 返回 MINI_ERR_IO, 超时返回 MINI_ERR_TIMEOUT
 */
static int s_master_write(I2C_TypeDef* i2c, uint8_t addr_byte, const uint8_t* tx, size_t len,
                          bool send_stop, uint32_t* budget)
{
    int ret = s_wait_flag(i2c, I2C_FLAG_BUSY, RESET, budget);
    if (ret != MINI_OK)
        return ret;
    I2C_GenerateSTART(i2c, ENABLE);
    ret = s_wait_flag(i2c, I2C_FLAG_SB, SET, budget);
    if (ret != MINI_OK)
        goto s_fail;
    I2C_Send7bitAddress(i2c, addr_byte, I2C_Direction_Transmitter);
    ret = s_wait_flag(i2c, I2C_FLAG_ADDR, SET, budget);
    if (ret != MINI_OK)
        goto s_fail;
    (void)s_wait_flag(i2c, I2C_FLAG_ADDR, RESET, budget); /* 读 SR2 清 ADDR */

    for (size_t i = 0; i < len; i++)
    {
        ret = s_wait_flag(i2c, I2C_FLAG_TXE, SET, budget);
        if (ret != MINI_OK)
            goto s_fail;
        I2C_SendData(i2c, tx[i]);
    }
    ret = s_wait_flag(i2c, I2C_FLAG_BTF, SET, budget);
    if (ret != MINI_OK)
        goto s_fail;
    if (I2C_GetFlagStatus(i2c, I2C_FLAG_AF) == SET)
    {
        /* 从机 NACK */
        I2C_ClearFlag(i2c, I2C_FLAG_AF);
        I2C_GenerateSTOP(i2c, ENABLE);
        return MINI_ERR_IO;
    }
    if (send_stop)
        I2C_GenerateSTOP(i2c, ENABLE);
    return MINI_OK;

s_fail:
    I2C_GenerateSTOP(i2c, ENABLE);
    return (ret == MINI_OK) ? MINI_ERR_IO : ret;
}

/**
 * @brief 主机读段 (可重复 START + addr + 收 len 字节, 最后一字节 NACK + STOP)
 * @param[in] i2c I2C 外设寄存器指针 (出参, 仅读数据寄存器)
 * @param[in] addr_byte 7-bit 地址左移后的地址字节 (含读写位)
 * @param[out] rx 接收缓冲区首地址 (出参, 写入接收数据)
 * @param[in] len 接收字节数 (出参)
 * @param[in] repeated_start 是否重复 START (先写后读时写段已发过地址)
 * @param[in,out] budget 空转预算指针 (消耗至 0 返回超时)
 * @return 成功返回 MINI_OK, 超时返回 MINI_ERR_TIMEOUT, IO 错误返回 MINI_ERR_IO
 */
static int s_master_read(I2C_TypeDef* i2c, uint8_t addr_byte, uint8_t* rx, size_t len,
                         bool repeated_start, uint32_t* budget)
{
    if (len == 0U)
        return MINI_OK;
    int ret;
    if (!repeated_start)
    {
        ret = s_wait_flag(i2c, I2C_FLAG_BUSY, RESET, budget);
        if (ret != MINI_OK)
            return ret;
    }
    I2C_AcknowledgeConfig(i2c, ENABLE);
    I2C_GenerateSTART(i2c, ENABLE);
    ret = s_wait_flag(i2c, I2C_FLAG_SB, SET, budget);
    if (ret != MINI_OK)
        goto s_fail;
    I2C_Send7bitAddress(i2c, addr_byte, I2C_Direction_Receiver);
    ret = s_wait_flag(i2c, I2C_FLAG_ADDR, SET, budget);
    if (ret != MINI_OK)
        goto s_fail;
    if (len == 1U)
        I2C_AcknowledgeConfig(i2c, DISABLE); /* 单字节读: 清 ADDR 前先关 ACK */
    (void)s_wait_flag(i2c, I2C_FLAG_ADDR, RESET, budget); /* 读 SR2 清 ADDR */

    for (size_t i = 0; i < len; i++)
    {
        if ((i == (len - 1U)) && (len > 1U))
            I2C_AcknowledgeConfig(i2c, DISABLE);
        ret = s_wait_flag(i2c, I2C_FLAG_RXNE, SET, budget);
        if (ret != MINI_OK)
            goto s_fail;
        rx[i] = (uint8_t)I2C_ReceiveData(i2c);
    }
    I2C_GenerateSTOP(i2c, ENABLE);
    I2C_AcknowledgeConfig(i2c, ENABLE);
    return MINI_OK;

s_fail:
    I2C_GenerateSTOP(i2c, ENABLE);
    I2C_AcknowledgeConfig(i2c, ENABLE);
    return (ret == MINI_OK) ? MINI_ERR_IO : ret;
}

/* =============================================================================
 * DMA 收发 (DMA1 固定映射: I2C1 TX/RX=CH6/CH7, I2C2 TX/RX=CH2/CH3)
 * ============================================================================= */

/**
 * @brief I2C 基址 → DMA1 收发通道 (固定映射查表)
 * @param[in] i2c_base I2Cx_BASE
 * @param[out] tx_ch 发送通道输出指针 (内存→外设)
 * @param[out] rx_ch 接收通道输出指针 (外设→内存)
 * @return 成功返回 MINI_OK, 无映射返回 MINI_ERR_NOTSUPP
 */
static int s_i2c_dma_channels(uintptr_t i2c_base, DMA_Channel_TypeDef** tx_ch,
                              DMA_Channel_TypeDef** rx_ch)
{
    switch (i2c_base)
    {
    case I2C1_BASE:
        *tx_ch = DMA1_Channel6;
        *rx_ch = DMA1_Channel7;
        return MINI_OK;
    case I2C2_BASE:
        *tx_ch = DMA1_Channel2;
        *rx_ch = DMA1_Channel3;
        return MINI_OK;
    default:
        *tx_ch = NULL;
        *rx_ch = NULL;
        return MINI_ERR_NOTSUPP;
    }
}

/**
 * @brief 停止 DMA 通道 (去使能 + 清全部标志)
 * @param[in] ch DMA 通道指针 (NULL 安全)
 */
static void s_i2c_dma_stop(DMA_Channel_TypeDef* ch)
{
    if (ch == NULL)
        return;
    uint32_t idx = ((uint32_t)((uintptr_t)ch - DMA1_Channel1_BASE) / 0x14U) + 1U;
    DMA_Cmd(ch, DISABLE);
    DMA_ClearFlag(0xFU << ((idx - 1U) * 4U)); /* GL/TC/HT/TE 全清 */
}

/**
 * @brief 配置并启动一个 DMA 通道 (字节宽度, 内存自增, 不等待)
 * @param[in] ch DMA 通道指针 (出参, 写配置寄存器)
 * @param[in] periph_addr 外设数据寄存器地址 (&I2Cx->DATAR)
 * @param[in] mem_addr 内存缓冲区地址 (DMA 期间须保持有效)
 * @param[in] units 搬运字节数 (1..65535)
 * @param[in] dir DMA_DIR_PeripheralDST / DMA_DIR_PeripheralSRC (直投)
 */
static void s_i2c_dma_arm(DMA_Channel_TypeDef* ch, uint32_t periph_addr, uint32_t mem_addr,
                          uint32_t units, uint32_t dir)
{
    uint32_t idx = ((uint32_t)((uintptr_t)ch - DMA1_Channel1_BASE) / 0x14U) + 1U;

    DMA_Cmd(ch, DISABLE);

    DMA_InitTypeDef di;
    di.DMA_PeripheralBaseAddr = periph_addr;
    di.DMA_MemoryBaseAddr = mem_addr;
    di.DMA_DIR = dir;
    di.DMA_BufferSize = units;
    di.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    di.DMA_MemoryInc = DMA_MemoryInc_Enable;
    di.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    di.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    di.DMA_Mode = DMA_Mode_Normal;
    di.DMA_Priority = DMA_Priority_High;
    di.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(ch, &di);

    DMA_ClearFlag(1U << (((idx - 1U) * 4U) + 1U)); /* TC */
    DMA_ClearFlag(1U << (((idx - 1U) * 4U) + 3U)); /* TE */
    DMA_Cmd(ch, ENABLE);
}

/**
 * @brief 轮询等待通道传输完成 (消耗超时预算, 中途检测传输错误)
 * @param[in] ch DMA 通道指针 (仅读标志)
 * @param[in,out] budget 空转预算指针 (消耗至 0 返回超时)
 * @return 成功返回 MINI_OK, 传输错误返回 MINI_ERR_IO, 超时返回 MINI_ERR_TIMEOUT
 */
static int s_i2c_dma_wait_tc(DMA_Channel_TypeDef* ch, uint32_t* budget)
{
    uint32_t idx = ((uint32_t)((uintptr_t)ch - DMA1_Channel1_BASE) / 0x14U) + 1U;
    uint32_t shift = (idx - 1U) * 4U;
    const uint32_t tc = 1U << (shift + 1U);
    const uint32_t te = 1U << (shift + 3U);
    while (DMA_GetFlagStatus(tc) == RESET)
    {
        if (DMA_GetFlagStatus(te) != RESET)
            return MINI_ERR_IO;
        if (*budget == 0U)
            return MINI_ERR_TIMEOUT;
        (*budget)--;
    }
    return MINI_OK;
}

/**
 * @brief 主机 DMA 写段 (START + addr + DMA 搬运 + 可选 STOP, NACK 检测返回 IO 错误)
 * @param[in] i2c I2C 外设寄存器指针 (出参, 写寄存器)
 * @param[in] addr_byte 7-bit 地址左移后的地址字节 (含读写位)
 * @param[in] tx 发送缓冲区首地址 (DMA 期间须保持有效)
 * @param[in] len 发送字节数
 * @param[in] send_stop 是否发送 STOP (先写后读时写段不发 STOP)
 * @param[in,out] budget 空转预算指针 (消耗至 0 返回超时)
 * @return 成功返回 MINI_OK, 从机 NACK 返回 MINI_ERR_IO, 超时返回 MINI_ERR_TIMEOUT
 */
static int s_i2c_dma_write(I2C_TypeDef* i2c, uint8_t addr_byte, const uint8_t* tx, size_t len,
                           bool send_stop, uint32_t* budget)
{
    DMA_Channel_TypeDef* tx_ch = NULL;
    DMA_Channel_TypeDef* rx_ch = NULL;
    int ret = s_i2c_dma_channels((uintptr_t)i2c, &tx_ch, &rx_ch);
    if (ret != MINI_OK)
        return ret;
    if (len == 0U)
        return MINI_OK;

    ret = s_wait_flag(i2c, I2C_FLAG_BUSY, RESET, budget);
    if (ret != MINI_OK)
        return ret;
    I2C_GenerateSTART(i2c, ENABLE);
    ret = s_wait_flag(i2c, I2C_FLAG_SB, SET, budget);
    if (ret != MINI_OK)
        goto s_fail;
    I2C_Send7bitAddress(i2c, addr_byte, I2C_Direction_Transmitter);
    ret = s_wait_flag(i2c, I2C_FLAG_ADDR, SET, budget);
    if (ret != MINI_OK)
        goto s_fail;
    (void)s_wait_flag(i2c, I2C_FLAG_ADDR, RESET, budget); /* 读 SR2 清 ADDR */

    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
    s_i2c_dma_arm(tx_ch, (uint32_t)&i2c->DATAR, (uint32_t)tx, (uint32_t)len, DMA_DIR_PeripheralDST);
    I2C_DMACmd(i2c, ENABLE);

