H-000-H/Project-repository/hal/hal_i2c_ch32v30x.c
    ret = s_i2c_dma_wait_tc(tx_ch, budget);
    if (ret != MINI_OK)
        goto s_fail;
    ret = s_wait_flag(i2c, I2C_FLAG_BTF, SET, budget); /* 等末字节移出 */
    if (ret != MINI_OK)
        goto s_fail;
    I2C_DMACmd(i2c, DISABLE);
    s_i2c_dma_stop(tx_ch);

    if (I2C_GetFlagStatus(i2c, I2C_FLAG_AF) == SET)
    {
        /* 从机 NACK */
        I2C_ClearFlag(i2c, I2C_FLAG_AF);
        I2C_GenerateSTOP(i2c, ENABLE);
        return MINI_ERR_IO;
    }
    if (send_stop)
        I2C_GenerateSTOP(i2c, ENABLE);
    return MINI_OK;

s_fail:
    I2C_DMACmd(i2c, DISABLE);
    s_i2c_dma_stop(tx_ch);
    I2C_GenerateSTOP(i2c, ENABLE);
    return (ret == MINI_OK) ? MINI_ERR_IO : ret;
}

/**
 * @brief 主机 DMA 读段 (可重复 START + addr + DMA 搬运, 末字节经 DMAEOT/关 ACK 产生 NACK)
 * @param[in] i2c I2C 外设寄存器指针 (出参, 读数据寄存器)
 * @param[in] addr_byte 7-bit 地址左移后的地址字节 (含读写位)
 * @param[out] rx 接收缓冲区首地址 (DMA 期间须保持有效)
 * @param[in] len 接收字节数
 * @param[in] repeated_start 是否重复 START (先写后读时写段已发过地址)
 * @param[in,out] budget 空转预算指针 (消耗至 0 返回超时)
 * @return 成功返回 MINI_OK, 超时返回 MINI_ERR_TIMEOUT, IO 错误返回 MINI_ERR_IO
 */
static int s_i2c_dma_read(I2C_TypeDef* i2c, uint8_t addr_byte, uint8_t* rx, size_t len,
                          bool repeated_start, uint32_t* budget)
{
    DMA_Channel_TypeDef* tx_ch = NULL;
    DMA_Channel_TypeDef* rx_ch = NULL;
    int ret = s_i2c_dma_channels((uintptr_t)i2c, &tx_ch, &rx_ch);
    if (ret != MINI_OK)
        return ret;
    if (len == 0U)
        return MINI_OK;
    if (!repeated_start)
    {
        ret = s_wait_flag(i2c, I2C_FLAG_BUSY, RESET, budget);
        if (ret != MINI_OK)
            return ret;
    }
    I2C_AcknowledgeConfig(i2c, ENABLE);
    if (len > 1U)
        I2C_DMALastTransferCmd(i2c, ENABLE); /* DMAEOT: 末字节自动 NACK */
    I2C_GenerateSTART(i2c, ENABLE);
    ret = s_wait_flag(i2c, I2C_FLAG_SB, SET, budget);
    if (ret != MINI_OK)
        goto s_fail;
    I2C_Send7bitAddress(i2c, addr_byte, I2C_Direction_Receiver);
    ret = s_wait_flag(i2c, I2C_FLAG_ADDR, SET, budget);
    if (ret != MINI_OK)
        goto s_fail;
    if (len == 1U)
        I2C_AcknowledgeConfig(i2c, DISABLE); /* 单字节读: 清 ADDR 前先关 ACK */
    (void)s_wait_flag(i2c, I2C_FLAG_ADDR, RESET, budget); /* 读 SR2 清 ADDR */

    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
    s_i2c_dma_arm(rx_ch, (uint32_t)&i2c->DATAR, (uint32_t)rx, (uint32_t)len, DMA_DIR_PeripheralSRC);
    I2C_DMACmd(i2c, ENABLE);

    ret = s_i2c_dma_wait_tc(rx_ch, budget);
    I2C_DMACmd(i2c, DISABLE);
    I2C_DMALastTransferCmd(i2c, DISABLE);
    s_i2c_dma_stop(rx_ch);
    if (ret != MINI_OK)
        goto s_fail;
    I2C_GenerateSTOP(i2c, ENABLE);
    I2C_AcknowledgeConfig(i2c, ENABLE);
    return MINI_OK;

s_fail:
    I2C_GenerateSTOP(i2c, ENABLE);
    I2C_AcknowledgeConfig(i2c, ENABLE);
    return (ret == MINI_OK) ? MINI_ERR_IO : ret;
}

/**
 * @brief 按传输长度扩容超时预算 (每字节约 10 bit, 慢速时钟下耗时随长度线性增长)
 * @param[in] pdev I2C 设备指针 (仅读速率配置)
 * @param[in] bytes 总传输字节数 (写 + 读)
 * @param[in] timeout_ms 调用方给的超时毫秒数 (叠加扩容量)
 * @return 空转预算 (按 SystemCoreClock 折算)
 */
static uint32_t s_i2c_dma_budget(const struct hal_i2c_dev* pdev, size_t bytes, uint32_t timeout_ms)
{
    uint32_t speed = (pdev->cfg.clock_speed_hz != 0U) ? pdev->cfg.clock_speed_hz : 100000U;
    uint32_t xfer_ms = (((uint32_t)bytes * 10U * 1000U) / speed) + 1U;
    return ch32_poll_budget(timeout_ms + xfer_ms);
}

/* -------------------------------------------------------------------------- */

/* =============================================================================
 * 上层接口 (hal_i2c.h)
 * ============================================================================= */

/**
 * @brief 初始化 I2C 主机总线 (时钟 + SCL/SDA 引脚直投)
 * @param[in] host I2C 主机上下文指针 (出参, 写入总线句柄与状态)
 * @param[in] hw_idx 硬件索引 (原样保存)
 * @param[in] cfg I2C 总线配置指针 (拷贝至 host->cfg)
 * @return 成功返回 MINI_OK, 参数为空返回 MINI_ERR_INVAL
 */
int hal_i2c_bus_host_init(struct hal_i2c_bus_host* host, int hw_idx,
                          const struct hal_i2c_bus_config* cfg)
{
    if ((host == NULL) || (cfg == NULL))
        return MINI_ERR_INVAL;
    host->cfg = *cfg;
    host->i2c = cfg->i2c;
    host->hw_idx = hw_idx;
    host->ref_count = 0;
    host->bus_ready = false;
    host->hw_inited = false;
    host->active_cfg.clock_speed_hz = 0U;

    int ret = ch32_rcc_enable(cfg->i2c, cfg->i2c_clk_periph);
    if (ret != MINI_OK)
        return ret;

    /* SCL / SDA: 缺省复用开漏 */
    if (cfg->scl.port != 0U)
    {
        ret = ch32_gpio_port_clk(cfg->scl.port, cfg->scl.clk_bus);
        if (ret != MINI_OK)
            return ret;
        uint32_t scl_mode = (cfg->scl.mode != 0U) ? cfg->scl.mode : (uint32_t)GPIO_Mode_AF_OD;
        ret = ch32_gpio_cfg_pin(cfg->scl.port, ch32_pin_to_mask(cfg->scl.pin), scl_mode,
                                cfg->scl.speed, cfg->scl.pull);
        if (ret != MINI_OK)
            return ret;
    }
    if (cfg->sda.port != 0U)
    {
        ret = ch32_gpio_port_clk(cfg->sda.port, cfg->sda.clk_bus);
        if (ret != MINI_OK)
            return ret;
        uint32_t sda_mode = (cfg->sda.mode != 0U) ? cfg->sda.mode : (uint32_t)GPIO_Mode_AF_OD;
        ret = ch32_gpio_cfg_pin(cfg->sda.port, ch32_pin_to_mask(cfg->sda.pin), sda_mode,
                                cfg->sda.speed, cfg->sda.pull);
        if (ret != MINI_OK)
            return ret;
    }

    host->hw_inited = true;
    return MINI_OK;
}

/**
 * @brief 去初始化 I2C 主机总线 (关外设, 不开总线时钟)
 * @param[in] host I2C 主机上下文指针 (出参, 写回状态)
 * @return 成功返回 MINI_OK, 参数为空返回 MINI_ERR_INVAL
 */
int hal_i2c_bus_host_deinit(struct hal_i2c_bus_host* host)
{
    if (host == NULL)
        return MINI_ERR_INVAL;
    if (host->hw_inited)
    {
        I2C_TypeDef* i2c = (I2C_TypeDef*)host->i2c;
        I2C_Cmd(i2c, DISABLE);
        host->hw_inited = false;
        host->bus_ready = false;
    }
    return MINI_OK;
}

/**
 * @brief 初始化 I2C 设备 (绑定总线与设备配置)
 * @param[in] pdev I2C 设备指针 (出参)
 * @param[in] host I2C 主机上下文 (总线必须已初始化)
 * @param[in] dev_cfg I2C 设备配置指针 (拷贝至 pdev->cfg)
 * @return 成功返回 MINI_OK, 参数为空返回 MINI_ERR_INVAL
 */
int hal_i2c_dev_init(struct hal_i2c_dev* pdev, struct hal_i2c_bus_host* host,
                     const struct hal_i2c_device_config* dev_cfg)
{
    if ((pdev == NULL) || (host == NULL) || (dev_cfg == NULL))
        return MINI_ERR_INVAL;
    pdev->ctlr = host;
    pdev->cfg = *dev_cfg;
    pdev->hw_open = 0;
    return MINI_OK;
}

/**
 * @brief 去初始化 I2C 设备 (关闭总线引用)
 * @param[in] pdev I2C 设备指针 (已绑定总线)
 * @return 成功返回 MINI_OK, 参数为空返回 MINI_ERR_INVAL
 */
int hal_i2c_dev_deinit(struct hal_i2c_dev* pdev)
{
    if (pdev == NULL)
        return MINI_ERR_INVAL;
    if (pdev->hw_open > 0)
    {
        int ret = hal_i2c_dev_hw_close(pdev);
        if (ret != MINI_OK)
            return ret;
    }
    pdev->ctlr = NULL;
    return MINI_OK;
}

/**
 * @brief 打开 I2C 设备 (应用配置并累加总线引用计数)
 * @param[in] pdev I2C 设备指针 (已绑定总线和配置)
 * @return 成功返回 MINI_OK, 参数为空返回 MINI_ERR_INVAL, 配置失败透传错误码
 */
int hal_i2c_dev_hw_open(struct hal_i2c_dev* pdev)
{
    if ((pdev == NULL) || (pdev->ctlr == NULL))
        return MINI_ERR_INVAL;
    int ret = s_i2c_apply_dev_cfg(pdev->ctlr, &pdev->cfg);
    if (ret != MINI_OK)
        return ret;
    pdev->ctlr->ref_count++;
    pdev->hw_open++;
    return MINI_OK;
}

/**
 * @brief 关闭 I2C 设备 (累减总线引用计数, 归零后发 STOP)
 * @param[in] pdev I2C 设备指针 (已绑定总线)
 * @return 成功返回 MINI_OK, 参数为空返回 MINI_ERR_INVAL
 */
int hal_i2c_dev_hw_close(struct hal_i2c_dev* pdev)
{
    if ((pdev == NULL) || (pdev->ctlr == NULL))
        return MINI_ERR_INVAL;
    struct hal_i2c_bus_host* host = pdev->ctlr;
    if (pdev->hw_open > 0)
    {
        pdev->hw_open--;
        if (host->ref_count > 0)
            host->ref_count--;
    }
    if (host->ref_count == 0)
    {
        I2C_TypeDef* i2c = (I2C_TypeDef*)host->i2c;
        I2C_GenerateSTOP(i2c, ENABLE);
        host->bus_ready = false;
    }
    return MINI_OK;
}

/**
 * @brief I2C 主机同步写 (内部左移 7-bit 地址, 支持重复传输)
 * @param[in] pdev I2C 设备指针 (必须已绑定总线并完成 dev_init)
 * @param[in] tx 发送缓冲区 (允许空指针配合 len=0)
 * @param[in] len 发送字节数 (不超过 HAL_I2C_MAX_XFER)
 * @param[in] timeout_ms 超时毫秒数 (按 SystemCoreClock 折算空转预算)
 * @return 成功返回 MINI_OK, 从机 NACK 返回 MINI_ERR_IO, 超时返回 MINI_ERR_TIMEOUT,
 *         参数无效返回 MINI_ERR_INVAL
 */
int hal_i2c_write(struct hal_i2c_dev* pdev, const uint8_t* tx, size_t len, uint32_t timeout_ms)
{
    if ((pdev == NULL) || (pdev->ctlr == NULL))
        return MINI_ERR_INVAL;
    if ((tx == NULL) && (len != 0U))
        return MINI_ERR_INVAL;
    if (len > HAL_I2C_MAX_XFER)
        return MINI_ERR_INVAL;
    I2C_TypeDef* i2c = (I2C_TypeDef*)pdev->ctlr->i2c;
    uint8_t addr_byte = (uint8_t)((pdev->cfg.address & 0x7FU) << 1);
    uint32_t budget = ch32_poll_budget(timeout_ms);
    return s_master_write(i2c, addr_byte, tx, len, true, &budget);
}

/**
 * @brief I2C 主机同步读 (内部左移 7-bit 地址, 支持重复传输)
 * @param[in] pdev I2C 设备指针 (必须已绑定总线并完成 dev_init)
 * @param[out] rx 接收缓冲区 (允许空指针配合 len=0)
 * @param[in] len 接收字节数 (不超过 HAL_I2C_MAX_XFER)
 * @param[in] timeout_ms 超时毫秒数 (按 SystemCoreClock 折算空转预算)
 * @return 成功返回 MINI_OK, 超时返回 MINI_ERR_TIMEOUT, IO 错误返回 MINI_ERR_IO,
 *         参数无效返回 MINI_ERR_INVAL
 */
int hal_i2c_read(struct hal_i2c_dev* pdev, uint8_t* rx, size_t len, uint32_t timeout_ms)
{
    if ((pdev == NULL) || (pdev->ctlr == NULL))
        return MINI_ERR_INVAL;
    if ((rx == NULL) && (len != 0U))
        return MINI_ERR_INVAL;
    if (len > HAL_I2C_MAX_XFER)
        return MINI_ERR_INVAL;
    I2C_TypeDef* i2c = (I2C_TypeDef*)pdev->ctlr->i2c;
    uint8_t addr_byte = (uint8_t)((pdev->cfg.address & 0x7FU) << 1);
    uint32_t budget = ch32_poll_budget(timeout_ms);
    return s_master_read(i2c, addr_byte, rx, len, false, &budget);
}

/**
 * @brief I2C 主机同步先写后读 (Repeated START, 写段不发 STOP)
 * @param[in] pdev I2C 设备指针 (必须已绑定总线并完成 dev_init)
 * @param[in] tx 发送缓冲区 (NULL = 纯读)
 * @param[out] rx 接收缓冲区 (NULL = 纯写)
 * @param[in] len 读写字节数 (不超过 HAL_I2C_MAX_XFER)
 * @param[in] timeout_ms 超时毫秒数 (按 SystemCoreClock 折算空转预算)
 * @return 成功返回 MINI_OK, 从机 NACK 返回 MINI_ERR_IO, 超时返回 MINI_ERR_TIMEOUT,
 *         参数无效返回 MINI_ERR_INVAL
 */
int hal_i2c_sync(struct hal_i2c_dev* pdev, const uint8_t* tx, uint8_t* rx, size_t len,
                 uint32_t timeout_ms)
{
    if ((pdev == NULL) || (pdev->ctlr == NULL))
        return MINI_ERR_INVAL;
    if (len > HAL_I2C_MAX_XFER)
        return MINI_ERR_INVAL;
    if ((tx == NULL) && (rx == NULL))
        return MINI_ERR_INVAL;
    I2C_TypeDef* i2c = (I2C_TypeDef*)pdev->ctlr->i2c;
    uint8_t addr_byte = (uint8_t)((pdev->cfg.address & 0x7FU) << 1);
    uint32_t budget = ch32_poll_budget(timeout_ms);

