H-000-H/Project-repository/hal/hal_i2c_ch32v30x.c
    if ((tx != NULL) && (rx == NULL))
        return s_master_write(i2c, addr_byte, tx, len, true, &budget);
    if ((tx == NULL) && (rx != NULL))
        return s_master_read(i2c, addr_byte, rx, len, false, &budget);

    /* 先写后读 (Repeated START, 写段不发 STOP) */
    int ret = s_master_write(i2c, addr_byte, tx, len, false, &budget);
    if (ret != MINI_OK)
        return ret;
    return s_master_read(i2c, addr_byte, rx, len, true, &budget);
}

/**
 * @brief I2C 主机 DMA 写 (内部左移 7-bit 地址, 预算按长度/速率扩容)
 * @param[in] pdev I2C 设备指针 (必须已绑定总线并完成 dev_init)
 * @param[in] tx 发送缓冲区 (允许空指针配合 len=0, DMA 期间须保持有效)
 * @param[in] len 发送字节数 (不超过 HAL_I2C_MAX_XFER)
 * @param[in] timeout_ms 超时毫秒数 (叠加传输耗时扩容量)
 * @return 成功返回 MINI_OK, 从机 NACK 返回 MINI_ERR_IO, 超时返回 MINI_ERR_TIMEOUT,
 *         无 DMA 映射返回 MINI_ERR_NOTSUPP, 参数无效返回 MINI_ERR_INVAL
 */
int hal_i2c_dma_write(struct hal_i2c_dev* pdev, const uint8_t* tx, size_t len, uint32_t timeout_ms)
{
    if ((pdev == NULL) || (pdev->ctlr == NULL))
        return MINI_ERR_INVAL;
    if ((tx == NULL) && (len != 0U))
        return MINI_ERR_INVAL;
    if (len > HAL_I2C_MAX_XFER)
        return MINI_ERR_INVAL;
    I2C_TypeDef* i2c = (I2C_TypeDef*)pdev->ctlr->i2c;
    uint8_t addr_byte = (uint8_t)((pdev->cfg.address & 0x7FU) << 1);
    uint32_t budget = s_i2c_dma_budget(pdev, len, timeout_ms);
    return s_i2c_dma_write(i2c, addr_byte, tx, len, true, &budget);
}

/**
 * @brief I2C 主机 DMA 读 (内部左移 7-bit 地址, 预算按长度/速率扩容)
 * @param[in] pdev I2C 设备指针 (必须已绑定总线并完成 dev_init)
 * @param[out] rx 接收缓冲区 (允许空指针配合 len=0, DMA 期间须保持有效)
 * @param[in] len 接收字节数 (不超过 HAL_I2C_MAX_XFER)
 * @param[in] timeout_ms 超时毫秒数 (叠加传输耗时扩容量)
 * @return 成功返回 MINI_OK, 超时返回 MINI_ERR_TIMEOUT, IO 错误返回 MINI_ERR_IO,
 *         无 DMA 映射返回 MINI_ERR_NOTSUPP, 参数无效返回 MINI_ERR_INVAL
 */
int hal_i2c_dma_read(struct hal_i2c_dev* pdev, uint8_t* rx, size_t len, uint32_t timeout_ms)
{
    if ((pdev == NULL) || (pdev->ctlr == NULL))
        return MINI_ERR_INVAL;
    if ((rx == NULL) && (len != 0U))
        return MINI_ERR_INVAL;
    if (len > HAL_I2C_MAX_XFER)
        return MINI_ERR_INVAL;
    I2C_TypeDef* i2c = (I2C_TypeDef*)pdev->ctlr->i2c;
    uint8_t addr_byte = (uint8_t)((pdev->cfg.address & 0x7FU) << 1);
    uint32_t budget = s_i2c_dma_budget(pdev, len, timeout_ms);
    return s_i2c_dma_read(i2c, addr_byte, rx, len, false, &budget);
}

/**
 * @brief I2C 主机 DMA 先写后读 (Repeated START, 写段不发 STOP)
 * @param[in] pdev I2C 设备指针 (必须已绑定总线并完成 dev_init)
 * @param[in] tx 发送缓冲区 (NULL = 纯读)
 * @param[out] rx 接收缓冲区 (NULL = 纯写)
 * @param[in] len 读写字节数 (不超过 HAL_I2C_MAX_XFER)
 * @param[in] timeout_ms 超时毫秒数 (叠加传输耗时扩容量)
 * @return 成功返回 MINI_OK, 从机 NACK 返回 MINI_ERR_IO, 超时返回 MINI_ERR_TIMEOUT,
 *         无 DMA 映射返回 MINI_ERR_NOTSUPP, 参数无效返回 MINI_ERR_INVAL
 */
int hal_i2c_dma_write_then_read(struct hal_i2c_dev* pdev, const uint8_t* tx, uint8_t* rx,
                                size_t len, uint32_t timeout_ms)
{
    if ((pdev == NULL) || (pdev->ctlr == NULL))
        return MINI_ERR_INVAL;
    if (len > HAL_I2C_MAX_XFER)
        return MINI_ERR_INVAL;
    if ((tx == NULL) && (rx == NULL))
        return MINI_ERR_INVAL;
    I2C_TypeDef* i2c = (I2C_TypeDef*)pdev->ctlr->i2c;
    uint8_t addr_byte = (uint8_t)((pdev->cfg.address & 0x7FU) << 1);
    uint32_t budget = s_i2c_dma_budget(pdev, 2U * len, timeout_ms);

    if ((tx != NULL) && (rx == NULL))
        return s_i2c_dma_write(i2c, addr_byte, tx, len, true, &budget);
    if ((tx == NULL) && (rx != NULL))
        return s_i2c_dma_read(i2c, addr_byte, rx, len, false, &budget);

    /* 先写后读 (Repeated START, 写段不发 STOP) */
    int ret = s_i2c_dma_write(i2c, addr_byte, tx, len, false, &budget);
    if (ret != MINI_OK)
        return ret;
    return s_i2c_dma_read(i2c, addr_byte, rx, len, true, &budget);
}
